app/views/center_works/_form.html.haml

SELECT `deparments`.* FROM `deparments`
---
    .col-sm-3
      = f.select :deparment_id, Deparment.all.collect{|x| [x.name, x.id]}, {:include_blank => 'Departamento'}, class: 'form-control'
  .form-group
    .col-sm-2
    .col-sm-4