app/views/admins/index.html.haml

          - i = 1
          - @roles[0].users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "users_roles" ON "users"."id" = "users_roles"."user_id" WHERE "users_roles"."role_id" = ?  [["role_id", 1]]