app/views/assign_roles/index.html.haml

				- superadmin = 0
				- user.roles.each do |role|
---
SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? AND "roles"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]