app/views/areas/_form.html.haml

SELECT `center_works`.* FROM `center_works`
---
    .col-sm-3
      = f.select :center_work_id, CenterWork.all.collect{|x| [x.name, x.id]}, {} , class: 'form-control'
  .form-group
    .col-sm-2
    .col-sm-3