app/controllers/admins_controller.rb

	def index
		@roles = Role.where(:name => 'admin')
		@admins = Admin.all
---
SELECT `roles`.* FROM `roles`  WHERE `roles`.`name` = 'admin'
SELECT "admins".* FROM "admins"

	def asignar
		@admin = User.find(params[:user_admin_id])
		@users = User.where(:asignado => 0)
		@asignados = Admin.where(:user_admin_id => params[:user_admin_id])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users`  WHERE `users`.`asignado` = 0
SELECT `admins`.* FROM `admins`  WHERE `admins`.`user_admin_id` = 1

	def add_admin
		admins = Admin.new(:user_admin_id => params[:user_admin_id], :user_normal_id => params[:user_normal_id])
		admins.save
		user = User.find(params[:user_normal_id])
		user.update(:asignado => 1)
---
INSERT INTO "admins" ("created_at", "updated_at", "user_admin_id", "user_normal_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-21 00:39:16.624439"], ["updated_at", "2014-08-21 00:39:16.624439"], ["user_admin_id", 1], ["user_normal_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "asignado" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["asignado", 1], ["updated_at", "2014-08-21 16:57:58.937078"]]

	def quitar_user
		admin = Admin.find(params[:admin_id])
		admin.destroy
		user = User.find(params[:user_id])
		user.update(:asignado => 0)
---
SELECT  "admins".* FROM "admins"  WHERE "admins"."id" = ? LIMIT 1  [["id", 27]]
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 27]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "asignado" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["asignado", 0], ["updated_at", "2014-08-21 17:40:36.659257"]]