app/controllers/assign_roles_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  `roles`.* FROM `roles`  WHERE `roles`.`name` = 'normal' LIMIT 1
---
	def asignar
		user = User.find(params[:user_id])
		#@user.roles.find(params[:role][:id])
		user.roles << Role.find_by_name(params[:role_name])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "roles".* FROM "roles"  WHERE "roles"."name" = 'normal' LIMIT 1
---
	def quitar
		user = User.find(params[:user_id])
		role_to_remove = Role.find_by_name(params[:role_name])