app/controllers/assign_roles_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  "roles".* FROM "roles"  WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 1]]
---
	def index
		@users = User.all

		user = User.find(1)
		role_to_remove = Role.find(1)
		user.roles.delete(role_to_remove)