app/controllers/user_turnos_controller.rb

	def asignar_turnos
		@user = User.find(params[:user_id])
		@turnos = Turno.all
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `turnos`.* FROM `turnos`