app/views/turnos/_form.html.haml

    .col-sm-10
      = f.select :orange, Turno.all.collect{|x| [x.title, x.id]}, {:include_blank => 'Seleccione'}, class: 'form-control'
  .actions
---
SELECT `turnos`.* FROM `turnos`