app/views/users/registrations/new.html.haml

SELECT `areas`.* FROM `areas`
---
      = f.label :area
      = f.select :area_id, Area.all.collect{|x| [x.name, x.id]}, {:include_blank => 'Seleccione'}, :autofocusss => true, class: 'form-control'